#include <windows.h>
#include <fcntl.h> 
#include <io.h> 
#include <stdlib.h> 
#include <stdio.h>
#include <math.h>
#include <float.h>
#include "SDL.h"
#include "gfx.h"
#include "moondust.h"
#include "motion_data.h"


SDL_Surface *g_screen=0;
int screen_colors[4];
int reset_flag=0;
int esc_flag=0;
int key_modify=0;
BYTE VIC_SPRITE_ENABLE;
int VIC_SPRITE_POSREG[8*2];// 0xd000 ;general label
BYTE VIC_SPRITE_COL[8];// 0xd027 ;general label
#define VIC_SPRITE0_COL  VIC_SPRITE_COL[0]
#define VIC_SPRITE1_COL  VIC_SPRITE_COL[1]
#define VIC_SPRITE2_COL  VIC_SPRITE_COL[2]
#define VIC_SPRITE3_COL  VIC_SPRITE_COL[3]
#define VIC_SPRITE4_COL  VIC_SPRITE_COL[4]
#define VIC_SPRITE5_COL  VIC_SPRITE_COL[5]
#define VIC_SPRITE6_COL  VIC_SPRITE_COL[6]
#define VIC_SPRITE7_COL  VIC_SPRITE_COL[7]
BYTE VIC_SPR2SPR_CDET=0;

BYTE SID_SOUND_REGS[255];
#define SID_V1_CONTROL_REG SID_SOUND_REGS[0x4]
#define SID_V2_CONTROL_REG SID_SOUND_REGS[0xB]
#define SID_FILTER_RES_VCTRL SID_SOUND_REGS[0x17]
//color constants

int RGB[]={
0x000000,
0xFFFFFF,
0x68372B,
0x70A4B2,
0x6F3D86,
0x588D43,
0x352879,
0xB8C76F,
0x6F4F25,
0x433900,
0x9A6759,
0x444444,
0x6C6C6C,
0x9AD284,
0x6C5EB5,
0x959595
};
int get_rgb(int c)
{
	if(c>0xF)
		return 0xFF0000;
	return RGB[c&0xF];
}
typedef struct{
	BYTE c;
	int x;
	int y;
	int scale;
	int color;
}OBJECTS;
OBJECTS objects[255];
int enable_walker=FALSE;

//----------------------------------------------
//SOFTWARE DEFINES

int CircleOffset        ;// 0x16
int CircleArcPosOffset  ;// 0x18
BYTE CircleOffsetAdder[3];// 0x1b
BYTE OscilTableOffset_1[3];// 0x1e
BYTE OscilTableOffset_2[3];// 0x21
int CircleRandomSeed    ;// 0x71
int Center_XPosition    ;// 0x78
int Center_YPosition    ;// 0x79
int ProximityLimit      ;// 0x94
int XDistance           ;// 0xc07d
int YDistance           ;// 0xc07e
int MaxPoints=0;// 0xc07f
int MaxPoints_High      ;// 0xc080
int SSmearDistance=0;// 0xc081
int Distance=0;// 0xc084
int Distance_High       ;// 0xc085
BYTE OscilTable[256];// 0x5d00
int CircleDivCounter    ;// 0xc030
int CArcPointsCounter   ;// 0x10
int CircleCntrPointX    ;// 0x5e
int CircleCntrPointY    ;// 0x5f

int BitmapXPos          ;// 0x11
int BitmapXPosMSB       ;// 0x12
int BitmapYPos          ;// 0x13
int BitmapBitpair       ;// 0x14

BYTE SpritePointers[8];// 0x07f8
int YPosition[10];// 0x24
int XPosition[10];// 0x2c
//BYTE XPositionMSB[8];// 0x39

int SpriteDataPointer   ;// 0xc01a
int SpriteDataNumber    ;// 0xc01d
BYTE SpriteDataCopy[63];// 0xc38a
BYTE SpriteDataBuffer[63];// 0xc326
BYTE sprite_mem[63*(2*16+1)];
int CurrentSpriteOffset ;// 0xc018
int OriginalRow         ;// 0x73
int OriginalColumn      ;// 0x72
int ModifiedRow         ;// 0x75
int ModifiedColumn      ;// 0x74
int CurrentRow          ;// 0x77
int CurrentColumn       ;// 0x76
BYTE SpriteLineBitpair[8];// 0x69

int TotalScore;
int TopScore;
int RoundScore=0;// 0xc08c
int RoundScoreHigh      ;// 0xc08d

int Pause_Flag          ;// 0x90

int TextData_Offset     ;// 0x63
int Text_XPosition      ;// 0x65
int Text_YPosition      ;// 0x67
int Text_YPosOverride   ;// 0x68
int NumMoveTextFlag     ;// 0x93
int DisplayNum=0;		// 0x05
int TextRenderEnable    ;// 0x8b
int AutoSwitchToMenu    ;// 0x5e
int AutoSwitchDelay     ;// 0xc07b
int Character_XPos[255];// 0xc0c8
int Character_XPosMSB   ;// 0xc12c
int Character_YPos[255];// 0xc190
BYTE *Character_DDAddr[255];// 0xc57e
int Character_DDOffset  ;// 0x15
int XPos_Subtractor     ;// 0x48
int YPos_Subtractor     ;// 0x49
int TextRefreshCounter  ;// 0x7b
int NumOfCharacters     ;// 0x7d
int InputCharOffset     ;// 0x7e
int OutputCharOffset    ;// 0x7c
int CurrentCharAddrOfs  ;// 0x64
int TitleScreenDelay    ;// 0x57
int BitmapChar_XPos     ;// 0x0c
int BitmapChar_XPosMSB  ;// 0x0d
int BitmapChar_YPos     ;// 0x0e
int GDBitmaskOffset     ;// 0x43
int BytePerRowCounter   ;// 0x42
int MaxBytesPerRow      ;// 0x47
int CharRowCounter      ;// 0x44
int MaxCharRows         ;// 0x46
int CharBitpairCtrl     ;// 0x37

int DecimalDigit        ;// 0xc093
int DecimalNumerals     ;// 0xc08e
int ZeroPrintFlag       ;// 0x55
int EndTermOffset       ;// 0x52

int MainEventDispCntr   ;// 0xc027
int ClearScreenDelay    ;// 0xc009
int LostSeedDispCntr    ;// 0xc010

int MenuSelectMoveDir   ;// 0xc012

BYTE ShiptrailDataOffset[8];// 0xc059
BYTE ShiptrailDataAddr[8];// 0xc1f4
BYTE ShipTurns[8];// 0xc061
BYTE CurrentCommandDelay[8];// 0xc051
BYTE CurrentTurnDelay[8]    ;// 0xc069
BYTE OriginalDelay[8]       ;// 0xc071
int NumberOfShips       ;// 0xc050

BYTE FacingDir[8];// 0x96
BYTE TurningDirFlag[8];// 0x9e
BYTE BorderCollisionFlag[8];// 0xa6
BYTE CommandDisableFlag[8];// 0xae

int ProgModeFlag        ;// 0xc07a
int ClearScreenFlag     ;// 0xc07c

int GameExecCtrlFlag    ;// 0x91
int GameOverFlag        ;// 0x92

int KnocksEnabled       ;// 0x86
int KnockLimit          ;// 0x8a
int NumberOfKnocks      ;// 0xc089
int NumberOfCollisions  ;// 0xc08b
int EvasiveFlag         ;// 0x8c
int EvasionActiveFlag   ;// 0xc02d
int SpinsanityFlag      ;// 0x88
int SeedsRemaining      ;// 0x89
int SWSmearExtent       ;// 0xc016
int MenuSelectorYPos    ;// 0xc013
int MenuSelectorXPos    ;// 0xc014
int MenuSelectEnable    ;// 0x56
BYTE SpinsanityCmdData[128];// 0x5e04
int PreciseFollowFlag   ;// 0x87
int SWalkerXPos         ;// 0xc028
int SWalkerYPos         ;// 0xc02a
int SWalkerXScrnSide    ;// 0xc02b
int SWalkerMSBXPos      ;// 0xc029
int SWalkerYPosAdder    ;// 0xc02c

int SoundChannel_Offset     ;// 0x5700
int SoundChannel_AddrOffset ;// 0x5701
int SoundRegs_BaseOffset    ;// 0x5702
BYTE SoundRegDump[255];     // 0x5705
int BaseEnvDataOffset       ;// 0x574c
int BaseFreqDataOffset      ;// 0x574d
int GenSoundFreqAdder       ;// 0x574e
WORD SoundFrequencyTable[12*8];// 0x59e1
BYTE PulseWidthSeed[3];// 0x7f
int SoundCtrlUpdateFlag     ;// 0x8e
BYTE *AttackDecayDataAddr[3];     ;// 0x5759
BYTE *EnvDelayDataAddr[3];        ;// 0x573d
BYTE CurrentSoundChannel;// 0x5749
BYTE ChordFreqAdders[7];// 0x59da
BYTE EnvDelayDataOffset[3];// 0x573a
BYTE EnvDelayCounter[3];// 0x5743
BYTE EnvCtrlFlag[3];             ;// 0x5762
int UpdateSoundMemoryFlag   ;// 0x574b
BYTE SoundMemory_Envelope[256];// 0x5774
BYTE SoundMemory_Frequency[256];// 0x5874
BYTE SoundMemoryOffset       ;// 0x5746
BYTE SoundMemoryOffsetAdder  ;// 0x5747
BYTE SoundOutDelayCounter    ;// 0x574f
BYTE SoundOutDelayLimit      ;// 0x5750
BYTE FilterRegOutFlag        ;// 0x5751
BYTE PreviousDirBits         ;// 0x5761
BYTE FilterCutoffFreqOffset  ;// 0x575f
BYTE CurrentResonance        ;// 0x5760

BYTE DivideLimit    ;// 0x4a
BYTE FreqDivCounter ;// 0x4b
BYTE TempBitmask    ;// 0x5b
BYTE TempXRegister  ;// 0x62

BYTE BitmapScreen[SCREEN_WIDTH*SCREEN_HEIGHT];	// 0x2000
BYTE ColorNybbles[40*25];		// 0xd800
BYTE CharData[1088];// 0x5000

int SeedSmearDispFlag       ;// 0xc00e
int SeedSmearEraseFlag      ;// 0xc023
WORD SeedSmearAddrTbl[40*25];// 0xc3ee
BYTE SeedSmearOfsEnd;// 0x38
BYTE SeedSmearColorData[256];// 0xc226
BYTE SeedSmearRemaining[8];// 0xc000
BYTE SS_CurrentOffset;// 0xc079
BYTE SSColorData_StartOfs;// 0xc040
int SeedSmearOfsMax=40*20; // 200
int SeedDropAllowFlag       ;// 0xc019
int SeedDropValidator       ;// 0xc088
int BullseyeDisplayFlag     ;// 0xc00a
int BullseyeFlag            ;// 0xc00b

int FrameCounter            ;// 0xc01b
int PreviousColorNybbles=0  ;// 0xc00c
int JoystickDelaySetting    ;// 0xc021
int JoystickDelayCounter    ;// 0xc022
BYTE JoystickDirBits=0;// 0xc00f
BYTE joyfire=0;

int TimeToWaste             ;// 0xc017
int FireButtonDebouncer     ;// 0xc00d
int SeedSmearDiff_Mul16     ;// 0x34
int XRegisterContents       ;// 0x030d
int KnockSpinAndSeedCntr    ;// 0xc08a



int main(){
	int i;
	srand(GetTickCount());
	init_audio();
    CopyCharacterData();
    LoadSprData();
    InitSoundAndIRQs();
    CreateOscilTable();  //do sub to create oscillating table
    Pause_Flag=0;
    TopScore=0;

WarmStartJump:
	TextRenderEnable=1;
	DisableSprites();
	ClearScreenStuff();

    TotalScore=0;         //clear total score
    KnocksEnabled=0;
    SpinsanityFlag=0;
    GameExecCtrlFlag=0;
    GameOverFlag=0;
    SoundCtrlUpdateFlag=0;   //clear sound control reg update flag and continue on here

    InitBitpairsAndCircles();   //do sub to setup bitpairs and some circle-related variables
    ClearScreenStuff();         //do sub to clear color and screen, memory, get seeds 

TitleScreenCore:
//	title_screen();
//	menu();
	game();
	goto TitleScreenCore;
}

int game(int game_mode){
	int i;
	int soundspeed=100;
	char str[255];
	POINT p;

restart:
	set_screen_buffer_size(120,50);
	set_screen_size(120,50);
	clrscr(TRUE);
